Revit 2025 API
CompoundStructureError Enumeration
 When CompoundStructure::isValid() returns false, it uses these values to indicate precise nature of defect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CompoundStructureError
Public Enumeration CompoundStructureError
public enum class CompoundStructureError
type CompoundStructureError
Members
Member name | Value | Description
BadShellOrder | 0 |  Layer Function Priorities ascend from the Core Boundary to the Finish Face.
CoreTooThin | 1 |  Core contain a membrane layer or thickness of core is zero.
MembraneTooThick | 3 |  Thickness of membrane layer is more than zero.
NonmembraneTooThin | 4 |  Thickness of non-membrane layer is too thin.
BadShellsStructure | 5 |  The number of shell layers is larger than the total number of layers.
ThinOuterLayer | 6 |  Thickness of face layer is too thin.
VerticalUnusedLayer | 7 |  A layer is not membrane layer and the Thickness of layer is zero.
VerticalWrongOrderLayer | 8 |  Layers assigned to the same Row are not on the same side of the Core Boundary.
VerticalWrongOrderCoreExterior | 9 |  Exterior core boundary have more than one face at any height.
VerticalWrongOrderCoreInterior | 10 |  Interior core boundary have more than one face at any height.
VerticalWrongOrderMembrane | 11 |  Membrane Layer have more than one face at any height.
DeckCantBoundAbove | 12 |  There is no layer above Structural deck or it is too thin.
DeckCantBoundBelow | 13 |  There is no layer below Structural deck or it is too thin.
VarThickLayerCantBeZero | 14 |  Variable thickness layer have zero thickness.
InvalidMaterialId | 15 |  Element id used as material id does not correspond to an actual MaterialElem.
ExtensibleRegionsNotContiguousAlongTop | 16 |  Extension Layers at the top of the wall must be adjacent.
ExtensibleRegionsNotContiguousAlongBottom | 17 |  Extension Layers at the bottom of the wall must be adjacent.
InvalidProfileId | 18 |  Element id used as profile id does not correspond to a valid deck profile.
Remarks
 'LayerTooThin' enum value was removed in 2016
See Also
Reference
Autodesk.Revit.DB Namespace